Revit 2027 API
FailureDefinition Properties
The FailureDefinition type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Severity |  The severity of the failure.
Top
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace